product = {'cat':{'ขนาด':'ใหญ่','สี':'ส้ม','ราคา':400},
           'dog':{'ขนาด':'กลาง','สี':'ดำ','ราคา':500},
           'duck':{'ขนาด':'เล็ด','สี':'เหลือง','ราคา':60}}
while True:
    print('-----กรุณากรอกข้อมูลให้ครบถ้วน-----')
    q = input('ป้อนชื่อสัตว์: ')
    r = int(input('จำนวน:' ))
    print('--------')
    if q in product:
        print(f'ชื่อสัตว์ที่คุณต้องการนำไปเลี้ยงคือ {q} \nขนาด{product[q]['ขนาด']} \nสี{product[q]['สี']}')
        print(f'จำนวนสัตว์เลี้ยงที่ต้องซื้อ{r}')
        
        print(f'ราคาที่ต้องจ่ายทั้งหมดคือ{product[q]['ราคา']* r}  บาท')


    